---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHookType.GetDefaultHookExtension(System.Double)
source: html/de092ae2-aed1-186b-a987-cf8e5a84cba6.htm
---
# Autodesk.Revit.DB.Structure.RebarHookType.GetDefaultHookExtension Method

Computes the default hook length, which is equal to barDiameter * multiplier.

## Syntax (C#)
```csharp
public double GetDefaultHookExtension(
	double barDiameter
)
```

## Parameters
- **barDiameter** (`System.Double`)